# Exploration des données

In [107]:
import pandas as pd
dataFrame=pd.read_csv("job-data.csv", encoding='latin-1')

In [108]:
dataFrame.head(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."
5,ServiceNow,Sr Staff Data Scientist - ATG,"Kirkland, Washington, United States",Full Time,Senior-level,184K+,"Computer Science,Deep Learning,Industrial,Mach...","401(k) matching,Career development,Competitive..."
6,Natixis in Portugal,Vendor Management and Data Quality Lead,"Porto, Portugal",Full Time,Entry-level,39K+ *,"Banking,Data quality,Excel,Security,,","Gear,,,,"
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,NaN,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex..."
9,Palo Alto Networks,Principal Cloud Data Engineer (Prisma Access),"Santa Clara, CA, United States",Full Time,Senior-level,140K+,"Agile,APIs,AWS,Azure,Big Data,Computer Science","Career development,Medical leave,Salary bonus,..."

In [109]:
dataFrame.sample(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
2868,Palo Alto Networks,Attack Surface Data Analyst (Xpanse),"Santa Clara, CA, United States",Full Time,Senior-level,74K+,"Engineering,Excel,Mathematics,Research,Securit...","Career development,Medical leave,Salary bonus,,"
21,Visa,Senior Data Engineer (Evergreen),"Bengaluru, India",Full Time,Senior-level,115K+ *,"Agile,Airflow,Clustering,Computer Science,Data...","Career development,Flex hours,,,"
2830,The Fork,Senior Data Engineer,"Paris, France",Full Time,Senior-level,115K+ *,"Agile,Airflow,Architecture,AWS,BigQuery,CI/CD","Career development,Competitive pay,Equity,Flex..."
2708,Enpal GmbH,(Senior) Business Intelligence Analyst SCM (f/...,"Berlin, Germany",Full Time,Senior-level,62K+ *,"AWS,Azure,BigQuery,Business Intelligence,Data ...","Home office stipend,Startup environment,Team e..."
397,Farfetch,Data Analyst,"PT Porto, Portugal",Full Time,Senior-level,92K+ *,"CX,Data Analytics,E-commerce,Engineering,Excel...","Flex hours,Health care,Insurance,,"
2131,Amazon.com,Applied Scientist,"Seattle, Washington, USA",Full Time,Senior-level,136K+,"ASR,AWS,Computer Vision,Data Mining,Machine Le...","Career development,Conferences,Equity,,"
3184,Brightspeed,"Senior Data Engineer, Customer Data Platform","Charlotte, NC, United States",Full Time,Senior-level,115K+ *,"Agile,CX,Data warehouse,ELT,ETL,GCP","Competitive pay,Equity,Health care,Salary bonu..."
1178,Bitquery,ML Engineer,"Bengaluru, Karnataka, India - Remote",Full Time,Mid-level,77K+ *,"Blockchain,Data analysis,GPU,HuggingFace,Machi...","Career development,Flat hierarchy,Startup envi..."
1879,Packt,Data Analyst,India - Remote,Full Time,Mid-level,65K+ *,"Data analysis,Data quality,Excel,Oracle,Python...","Career development,Flex hours,,,"
1549,Block,"Senior Product Manager, Data Infrastructure an...","Los Angeles, CA, United States",Full Time,Senior-level,142K+,"Banking,Blockchain,Crypto,Data pipelines,Engin...","Career development,Equity,Health care,Insuranc..."

On essai de afficher les premier lignes de notre data set pour just savoir sa forme.

<ul>
<li>Les valeurs NAN </li>
<p> est ce que on peut remplire ces valeur ? ou bien il faut les supprimer</p>
<li>list des <strong>facilities</strong></li>
<p>une list des que on peut la separer</p>
<li>forme de <strong>salary</strong> "48K+*" </li>
<p>des salaire avec des etoile ,cest quoi la senification de ces etoiles ?, on remarque que on a des salaire sans "*"</p>
<p>On remarque que les salaire sont on deferente davise il faut les unifier.(eur,£,$)</p>

<li>les  <strong>job title</strong> on deferente language il faut les unifier on oenlais ou bien en français </li>

<li>les  <strong>location</strong> on va les deviser par city,state county</li>


</ul>

In [110]:
print("list of unique Salary :",dataFrame["Salary"].sort_values(ascending=False).unique().tolist())

list of unique Salary : ['GBP 80K+', 'GBP 65K+', 'GBP 60K+', 'GBP 55K+', 'GBP 55K', 'GBP 54K+', 'GBP 51K+', 'GBP 50K+', 'GBP 45K+', 'GBP 42K+', 'GBP 35K', 'EUR 81K', 'EUR 80K+', 'EUR 60K+', 'EUR 36K+', 'EUR 130K+', ' 99K+', ' 98K+', ' 97K+', ' 96K+ *', ' 96K+', ' 95K+ *', ' 95K+', ' 94K+', ' 93K+', ' 92K+ *', ' 90K+ *', ' 90K+', ' 89K+ *', ' 86K+', ' 85K+', ' 84K+', ' 83K+', ' 82K+', ' 81K+ *', ' 81K+', ' 80K+ *', ' 80K+', ' 79K+', ' 78K+', ' 77K+ *', ' 76K+', ' 75K+ *', ' 75K+', ' 74K+ *', ' 74K+', ' 73K+ *', ' 73K+', ' 72K+', ' 71K+', ' 70K+ *', ' 70K+', ' 69K+ *', ' 68K+', ' 67K+', ' 66K+ *', ' 66K+', ' 65K+ *', ' 65K+', ' 63K+ *', ' 63K+', ' 62K+ *', ' 61K+ *', ' 60K+ *', ' 60K+', ' 59K+ *', ' 59K+', ' 57K+ *', ' 56K+ *', ' 55K+ *', ' 55K+', ' 54K+ *', ' 52K+', ' 51K+ *', ' 51K+', ' 50K+ *', ' 50K+', ' 49K+ *', ' 48K+ *', ' 45K+ *', ' 45K+', ' 44K+ *', ' 43K+', ' 42K+ *', ' 40K+ *', ' 40K+', ' 39K+ *', ' 36K+ *', ' 35K+ *', ' 33K+ *', ' 31K+ *', ' 315K+', ' 310K+', ' 30K+ *', ' 295K+', ' 283K+', ' 267K+', ' 253K+', ' 245K+', ' 236K+', ' 235K+', ' 234K+', ' 230K+', ' 227K+', ' 225K+', ' 224K+', ' 220K+', ' 218K+', ' 214K+', ' 207K+', ' 205K+', ' 204K+', ' 202K+', ' 200K+ *', ' 200K+', ' 199K+', ' 197K+', ' 196K+', ' 195K+', ' 193K+', ' 190K+', ' 189K+', ' 187K+', ' 185K+', ' 184K+ *', ' 184K+', ' 183K+', ' 182K+', ' 180K+', ' 179K+', ' 178K+', ' 177K+', ' 176K+', ' 175K+', ' 174K+', ' 173K+', ' 172K+', ' 171K+', ' 170K+', ' 168K+', ' 167K+', ' 166K+', ' 165K+', ' 164K+', ' 163K+', ' 161K+', ' 160K+', ' 159K+', ' 158K+', ' 157K+', ' 156K+', ' 155K+ *', ' 155K+', ' 154K+', ' 153K+', ' 152K+', ' 151K+', ' 150K+', ' 149K+', ' 148K+', ' 147K+', ' 146K+', ' 145K+', ' 144K+ *', ' 144K+', ' 143K+', ' 142K+', ' 141K+ *', ' 141K+', ' 140K+', ' 139K+', ' 138K+', ' 136K+', ' 135K+ *', ' 135K+', ' 134K+', ' 133K+', ' 132K+', ' 131K+ *', ' 131K+', ' 130K+', ' 129K+ *', ' 129K+', ' 128K+', ' 127K+', ' 126K+', ' 125K+', ' 124K+', ' 123K+', ' 122K+ *', ' 122K+', ' 121K+', ' 120K+ *', ' 120K+', ' 119K+', ' 117K+', ' 116K+', ' 115K+ *', ' 115K+', ' 113K+', ' 112K+', ' 111K+', ' 110K+ *', ' 110K+', ' 109K+ *', ' 109K+', ' 108K+', ' 107K+', ' 106K+', ' 105K+ *', ' 105K+', ' 104K+', ' 103K+ *', ' 103K+', ' 102K+ *', ' 102K+', ' 100K+ *', ' 100K+', nan]

In [111]:
dataFrame.Salary.sort_values(ascending=False)

1246    GBP 80K+
2536    GBP 65K+
1384    GBP 60K+
2492    GBP 55K+
2716     GBP 55K
          ...
3126         NaN
3134         NaN
3152         NaN
3159         NaN
3166         NaN
Name: Salary, Length: 3198, dtype: object

In [112]:
print("number of rows :",dataFrame.shape[0])

number of rows : 3198

In [113]:
print("number of columns :",str(dataFrame.shape[1])+" : "+ str(dataFrame.columns))

number of columns : 8 : Index(['Company', 'Job Title', 'Location', 'Job Type', 'Experience level',
       'Salary', 'Requirment of the company ', 'Facilities'],
      dtype='object')

In [114]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3198 entries, 0 to 3197
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     3197 non-null   object
 1   Job Title                   3197 non-null   object
 2   Location                    3197 non-null   object
 3   Job Type                    3197 non-null   object
 4   Experience level            2962 non-null   object
 5   Salary                      3009 non-null   object
 6   Requirment of the company   3198 non-null   object
 7   Facilities                  3198 non-null   object
dtypes: object(8)
memory usage: 200.0+ KB

In [115]:
dataFrame.describe()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
count,3197,3197,3197,3197,2962,3009,3198,3198
unique,1106,2138,1117,3,4,218,2600,777
top,Publicis Groupe,Data Engineer,"Bengaluru, India",Full Time,Senior-level,115K+ *,"Big Data,Business Intelligence,Data analysis,E...",",,,,"
freq,126,105,90,3116,1876,253,12,542

In [116]:
print("list of unique Job types :",dataFrame["Job Type"].unique())

list of unique Job types : ['Full Time' 'Internship' 'Part Time' nan]

In [117]:
print("list of unique Job Title :",dataFrame["Job Title"].unique())

list of unique Job Title : ['Clinical Data Analyst' 'AML/CFT & Data Analyst'
 'Machine Learning Engineer' ...
 'Application Integration Engineer, Computer Vision Program'
 'Senior Software Engineer, Machine Learning - Ads Intelligence'
 'Data Scientist - New College Graduate']

In [118]:
print("list of unique Experience level	 :",dataFrame["Experience level"].unique())

list of unique Experience level	 : ['Entry-level' nan 'Mid-level' 'Senior-level' 'Executive-level']

#### Duplicates

In [119]:
dataFrame.duplicated().sum()

202

In [120]:
dataFrame.drop_duplicates(inplace=True)

In [121]:
dataFrame.isna().sum()

Company                         1
Job Title                       1
Location                        1
Job Type                        1
Experience level              228
Salary                        172
Requirment of the company       0
Facilities                      0
dtype: int64

# Data Cleaning

#### Salary column

In [122]:
dataFrame["Salary"].isna().sum()

172

In [123]:
dataFrame["Salary"].str.strip()

0       48K+ *
1       48K+ *
2       90K+ *
3       48K+ *
4        108K+
         ...
3190     113K+
3191     106K+
3192     176K+
3193    39K+ *
3196    39K+ *
Name: Salary, Length: 2996, dtype: object

In [124]:
dataFrame[dataFrame["Salary"].isna()].sort_values('Location')

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
669,bunq,Data Science Intern - Large Language Models,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,"
973,bunq,Data Science Intern - Large Language Model,"Amsterdam, Noord-Holland, Netherlands",Internship,Entry-level,NaN,"Engineering,FinTech,LLMs,NLP,,","Career development,,,,"
3073,Definitive Logic,Data Science Intern,"Arlington, VA",Internship,Entry-level,NaN,"Big Data,Consulting,Consulting firm,Data analy...","Career development,Competitive pay,Flex hours,..."
1525,Cube RM,Business Data Analyst Intern,"Athens, Attica, Greece",Internship,Entry-level,NaN,"Agile,Azure,Computer Science,Data analysis,Exc...","Career development,Flex hours,Flex vacation,Ge..."
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
...,...,...,...,...,...,...,...,...
1669,Dentons,Marketing Data Analyst Intern,"Warsaw, Masovian Voivodeship, Poland",Internship,Entry-level,NaN,"Data analysis,Excel,,,,",",,,,"
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,NaN,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He..."
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,NaN,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,"
1954,Opera,Data Scientist Summer Intern,"Wroclaw, PL",Part Time,Entry-level,NaN,"Computer Science,Data analysis,Data visualizat...","Startup environment,,,,"
797,NaN,NaN,NaN,NaN,NaN,NaN,",,,,,",",,,,"

In [125]:
dataFrame.dropna(thresh=3,inplace=True)

In [126]:
dataFrame[dataFrame["Salary"].isna()]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,NaN,"Business Intelligence,Excel,Genetics,,,",",,,,"
8,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,NaN,"Big Data,Computer Science,Engineering,Machine ...","Career development,Competitive pay,Equity,Flex..."
39,Angi,Senior Data Scientist,"Indianapolis, IN - Hybrid",Full Time,Senior-level,NaN,"Big Data,Data Mining,Machine Learning,Mathemat...","401(k) matching,Career development,Competitive..."
44,REWE International Dienstleistungsgesellschaft...,Junior Data Science Engineer (m/w/x),"Wien, Austria",Full Time,Entry-level,NaN,"CI/CD,Computer Science,Data pipelines,Deep Lea...",",,,,"
75,Metiora,Data Analyst Intern,"Madrid, Spain",Full Time,Entry-level,NaN,"Matplotlib,MongoDB,NumPy,Pandas,Power BI,Python",",,,,"
...,...,...,...,...,...,...,...,...
3109,METRO/MAKRO,STAGE 6 mois - Data Scientist Junior H/F,"Nanterre, France",Full Time,Entry-level,NaN,"Big Data,Power BI,Python,R,SQL,",",,,,"
3134,Junglee Games,ETL and Data Warehouse Testing Intern,"Bengaluru, Karnataka, India",Internship,Entry-level,NaN,"Computer Science,Data quality,Data warehouse,E...",",,,,"
3152,Lely,"Stage: Computer Science, Robotics, Computer Vi...","Maassluis, Netherlands",Full Time,Entry-level,NaN,"Computer Science,Computer Vision,Engineering,O...",",,,,"
3159,Deezer,Data Analyst Intern m/f/d - Business,"Paris, France",Internship,Entry-level,NaN,"Data analysis,Data pipelines,Data visualizatio...","Career development,Health care,Insurance,Start..."
3166,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,NaN,"AWS,Computer Science,Data analysis,Data visual...","Career development,Flex hours,Flex vacation,He..."

In [127]:
dataFrame["Salary"].fillna('negociable',inplace=True)

In [128]:
dataFrame[dataFrame["Experience level"]=="Entry-level"]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
6,Natixis in Portugal,Vendor Management and Data Quality Lead,"Porto, Portugal",Full Time,Entry-level,39K+ *,"Banking,Data quality,Excel,Security,,","Gear,,,,"
7,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,negociable,"Business Intelligence,Excel,Genetics,,,",",,,,"
...,...,...,...,...,...,...,...,...
3164,Rackspace,Trainee Data Engineer - R-16792,India - Remote,Full Time,Entry-level,59K+ *,"Architecture,Azure,Big Data,Computer Science,D...","Team events,,,,"
3170,Wise,"Data Analytics Manager - Compliance, Risk & In...",London,Full Time,Entry-level,120K+ *,"Airflow,APIs,Data Analytics,Data pipelines,Dat...",",,,,"
3176,iTech Media,Data Analytics Engineer,Warsaw Remote,Full Time,Entry-level,30K+ *,"Airflow,Data Analytics,Engineering,Finance,Kaf...","Career development,Flex hours,Flex vacation,He..."
3193,Western Digital,Data Scientist - New College Graduate,"Biñan, Philippines",Full Time,Entry-level,39K+ *,"APIs,Clustering,Computer Science,Data visualiz...","Career development,,,,"
3196,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39K+ *,"Computer Science,Data Analytics,Data Mining,Ec...","Career development,Startup environment,,,"

In [129]:
# pour les valeurs nan on salaire on va les remplacer par "negociable" pour le moment 
#return
# dataFrame["Salary"].replace(['negociable'],'',inplace=True)

Ajout  autre colonne de bonuses (primes).

In [130]:
dataFrame[['Salary', 'Plus']] = dataFrame["Salary"].apply(lambda x: pd.Series(str(x).split("+")))

In [131]:
dataFrame["Plus"].fillna('no bonuses',inplace=True)

Bonuses est une colonnes qui sinifier les primes (*).

In [168]:
dataFrame[dataFrame["Salary"].isna()]

Empty DataFrame
Columns: [Company, Job Title, Location, Job Type, Experience level, Salary, Requirment of the company , Facilities, Plus, Currency]
Index: []

Ajout  autre colonne des devises.

In [133]:
dataFrame[['Currency','Salary']] = dataFrame["Salary"][dataFrame["Salary"]!="negociable"].apply(lambda x: pd.Series(str(x).split(" ")))

In [134]:
# les salaire avec des valeurs vides sont on dollar:
# dataFrame['Currency']=dataFrame['Currency'][dataFrame['Salary']=='negociable'].replace('negociable','USD',inplace=True)

In [169]:
# pour les valeurs nan on salaire on va les remplacer par "negociable" pour le moment 
dataFrame[dataFrame["Currency"]== "EUR"]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
6606,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000.0,Agile,Career development,False,EUR
6607,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000.0,Computer Science,Career development,False,EUR
6608,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000.0,Data analysis,Career development,False,EUR
6609,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000.0,Data management,Career development,False,EUR
6610,Bosch Group,Master Data Management Plants (f/m/div.) (sala...,"Karlsruhe, Germany",Full Time,Entry-level,81000.0,Data quality,Career development,False,EUR
...,...,...,...,...,...,...,...,...,...,...
28759,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000.0,Data Analytics,no-Facilities,False,EUR
28760,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000.0,KPIs,no-Facilities,False,EUR
28761,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000.0,PostgreSQL,no-Facilities,False,EUR
28762,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000.0,Power BI,no-Facilities,False,EUR
28763,CITECH,Ingénieur Data / Power BI (H/F),"Dijon, France",Full Time,Senior-level,60000.0,Python,no-Facilities,False,EUR

In [136]:
dataFrame['Currency'].replace('','USD',inplace=True)

In [137]:
dataFrame['Currency'][dataFrame['Salary'].isna()]=dataFrame['Currency'].str.replace('nan','--')

In [138]:
dataFrame['Plus'].replace('','no bonuses',inplace=True)

In [139]:
dataFrame['Plus'].replace(' *','bonuses',inplace=True)

In [140]:
dataFrame['Plus'] = dataFrame['Plus'].map({'bonuses': True, 'no bonuses': False})      # Replace string by boolean

In [176]:
print("list of unique Currency :",dataFrame["Currency"].unique().tolist())

list of unique Currency : ['USD', '--', 'EUR', 'GBP']

In [142]:
dataFrame['Currency'].replace('nan','USD',inplace=True)

In [143]:
dataFrame['Salary'] = dataFrame['Salary'].str.replace('K', '')

In [144]:
# change tonumerique
dataFrame["Salary"]=pd.to_numeric(dataFrame['Salary'], errors='coerce')*1000

In [145]:
dataFrame["Salary"].fillna(0,inplace=True)

In [179]:
dataFrame[dataFrame["Salary"]==0]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
90,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Business Intelligence,no-Facilities,False,--
91,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Excel,no-Facilities,False,--
92,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Genetics,no-Facilities,False,--
96,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,0.0,Big Data,Career development,False,--
97,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,0.0,Computer Science,Career development,False,--
...,...,...,...,...,...,...,...,...,...,...
59827,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Computer Science,Salary bonus,False,--
59828,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Data analysis,Salary bonus,False,--
59829,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Data visualization,Salary bonus,False,--
59830,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Machine Learning,Salary bonus,False,--
59831,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Mathematics,Salary bonus,False,--

In [177]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 58770 entries, 0 to 60329
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     58770 non-null  object
 1   Job Title                   58770 non-null  object
 2   Location                    58770 non-null  object
 3   Job Type                    58770 non-null  object
 4   Experience level            58770 non-null  object
 5   Salary                      58770 non-null  float64
 6   Requirment of the company   58770 non-null  object
 7   Facilities                  58770 non-null  object
 8   Plus                        58770 non-null  bool
 9   Currency                    58770 non-null  object
dtypes: bool(1), float64(1), object(8)
memory usage: 4.5+ MB

##### Experience level

In [147]:
print("list of unique Experience level :",dataFrame["Experience level"].unique().tolist())

list of unique Experience level : ['Entry-level', nan, 'Mid-level', 'Senior-level', 'Executive-level']

In [148]:
dataFrame['Facilities'] = dataFrame['Facilities'].str.replace(',,,,', '')

In [149]:
dataFrame["Experience level"].fillna('not-specified',inplace=True)

In [150]:
dataFrame["Experience level"]=dataFrame["Experience level"].str.replace('not-required','not-specified')

In [151]:
#Categorier les "Experience level" colonnes
data = pd.get_dummies(dataFrame, columns=['Experience level'])

In [152]:
data

,Company,Job Title,Location,Job Type,Salary,Requirment of the company,Facilities,Plus,Currency,Experience level_Entry-level,Experience level_Executive-level,Experience level_Mid-level,Experience level_Senior-level,Experience level_not-specified
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,48000.0,"Computer Science,Data quality,Genetics,Mathema...",,True,USD,1,0,0,0,0
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,48000.0,"Agile,Data management,Finance,Security,,",,True,USD,1,0,0,0,0
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,90000.0,"Agile,Architecture,AWS,Computer Science,Comput...",Career development,True,USD,0,0,0,0,1
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,48000.0,"Engineering,Industrial,Oracle,Power BI,R,R&D",,True,USD,1,0,0,0,0
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,108000.0,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi...",False,USD,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3190,CCRi,"Application Integration Engineer, Computer Vis...","Chantilly, Virginia, United States",Full Time,113000.0,"Agile,Angular,APIs,Architecture,AWS,Azure","401(k) matching,Career development,Flex hours,...",False,USD,0,0,1,0,0
3191,Publicis Groupe,"Associate Director, Data Science","New York City, United States",Full Time,106000.0,"Bayesian,Classification,Clustering,Data analys...","Career development,Health care,,,",False,USD,0,0,1,0,0
3192,DoorDash,"Senior Software Engineer, Machine Learning - A...","Sunnyvale, CA; San Francisco, CA; New York",Full Time,176000.0,"Computer Science,Data analysis,Engineering,Exc...","401(k) matching,Career development,Equity,Insu...",False,USD,0,0,0,1,0
3193,Western Digital,Data Scientist - New College Graduate,"Biñan, Philippines",Full Time,39000.0,"APIs,Clustering,Computer Science,Data visualiz...",Career development,True,USD,1,0,0,0,0
3196,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,39000.0,"Computer Science,Data Analytics,Data Mining,Ec...","Career development,Startup environment,,,",True,USD,1,0,0,0,0

#### Requirment of the company et Facilities

In [173]:
dataFrame[dataFrame["Company"]=='ATB Financial']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
31260,ATB Financial,Data Analyst,"Edmonton, Alberta, Canada",Full Time,Mid-level,65000.0,Agile,Flex hours,True,USD
31261,ATB Financial,Data Analyst,"Edmonton, Alberta, Canada",Full Time,Mid-level,65000.0,Banking,Flex hours,True,USD
31262,ATB Financial,Data Analyst,"Edmonton, Alberta, Canada",Full Time,Mid-level,65000.0,Business Analytics,Flex hours,True,USD
31263,ATB Financial,Data Analyst,"Edmonton, Alberta, Canada",Full Time,Mid-level,65000.0,Computer Science,Flex hours,True,USD
31264,ATB Financial,Data Analyst,"Edmonton, Alberta, Canada",Full Time,Mid-level,65000.0,Data analysis,Flex hours,True,USD
...,...,...,...,...,...,...,...,...,...,...
60325,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Data Analytics,no-Facilities,True,USD
60326,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Data Mining,no-Facilities,True,USD
60327,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Economics,no-Facilities,True,USD
60328,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Engineering,no-Facilities,True,USD
60329,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,GCP,no-Facilities,True,USD

In [154]:
def split_comma_column_values (colum_name_comma_value,dataFrame) :
    dataFrame[colum_name_comma_value] = dataFrame[colum_name_comma_value].str.split(',')
    new_df = dataFrame.explode(colum_name_comma_value)
    new_df = new_df.reset_index(drop=True)
    new_df[colum_name_comma_value].str.strip()
    new_df.drop_duplicates(inplace=True)
    return new_df

In [155]:
dataFrame=split_comma_column_values ('Facilities',dataFrame)

In [156]:
dataFrame.sample(10)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
9044,KMS Technology,Senior AI Engineer,"Ho Chi Minh City, Vietnam",Full Time,Senior-level,55000.0,"Computer Vision,Consulting,Healthcare technolo...",Team events,True,USD
4969,HolonIQ,Data Analyst - Chinese Speaker,"Colombo, Western Province, Sri Lanka",Full Time,Mid-level,65000.0,"Data management,Market research,Research,Secur...",,True,USD
10826,Version 1,Data Visualisation Consultant,"Redditch, United Kingdom",Full Time,not-specified,56000.0,"Agile,AWS,Azure,Business Intelligence,Consulti...",Yoga,True,USD
2772,SentinelOne,Senior ML Engineer (Remote),United States - Remote,Full Time,Senior-level,145000.0,"Computer Science,Data pipelines,Data visualiza...",Career development,False,USD
5614,Altana AI,Senior Implementation Data Scientist,"Washington, DC",Full Time,Senior-level,129000.0,"APIs,Architecture,AWS,Azure,Databricks,Docker",Career development,True,USD
1324,"EMW, Inc.",Power BI Developer,"Huntsville, Alabama, United States",Full Time,Mid-level,56000.0,"Engineering,Power BI,Security,Testing,,",Career development,True,USD
51,Canva,Senior Data Analyst - Sales,"Sydney, New South Wales, Australia",Full Time,Senior-level,92000.0,"BigQuery,Excel,Finance,Python,R,Redshift",Home office stipend,True,USD
10845,Exadel,Senior Data Engineer,"Bulgaria, Germany, Hungary, Lithuania, Poland,...",Full Time,Senior-level,115000.0,"Agile,Azure,CI/CD,Consulting,Data analysis,Dat...",Salary bonus,True,USD
10350,Oviva,Senior BI & Data Analyst,"london, United Kingdom",Full Time,Senior-level,92000.0,"BigQuery,Business Intelligence,Data Analytics,...",Startup environment,True,USD
11022,FREE NOW,Senior Data Scientist Marketplace (m/f/d) - Lo...,London,Full Time,Senior-level,129000.0,"Computer Science,Computer Vision,Databricks,En...",Career development,True,USD

In [157]:
print("list of unique Facilities :",dataFrame["Facilities"].unique().tolist()),"Length :"+str(len(dataFrame["Facilities"].unique().tolist()))

list of unique Facilities : ['', 'Career development', 'Flex hours', 'Flex vacation', 'Parental leave', 'Unlimited paid time off', '401(k) matching', 'Competitive pay', 'Equity', 'Gear', 'Health care', 'Medical leave', 'Salary bonus', 'Startup environment', 'Team events', 'Home office stipend', 'Insurance', 'Fitness / gym', 'Relocation support', 'Fertility benefits', 'Conferences', 'Cell phone stipend', 'Wellness', 'Transparency', 'Lunch / meals', 'Yoga', 'Flexible spending account', 'Travel', 'Snacks / Drinks', 'Paid sabbatical', 'Pet friendly', 'Flat hierarchy', 'Signing bonus', 'Contract', 'Freelance']

(None, 'Length :35')

In [158]:
dataFrame['Facilities'][dataFrame['Facilities'].str.fullmatch('')]=dataFrame['Facilities'][dataFrame['Facilities'].str.fullmatch('')].str.replace('', 'no-Facilities')

C:\Users\Youcode\AppData\Local\Temp\ipykernel_81164\2557170505.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataFrame['Facilities'][dataFrame['Facilities'].str.fullmatch('')]=dataFrame['Facilities'][dataFrame['Facilities'].str.fullmatch('')].str.replace('', 'no-Facilities')

In [159]:
dataFrame[dataFrame['Facilities']=='no-Facilities']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,"Computer Science,Data quality,Genetics,Mathema...",no-Facilities,True,USD
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,"Agile,Data management,Finance,Security,,",no-Facilities,True,USD
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48000.0,"Engineering,Industrial,Oracle,Power BI,R,R&D",no-Facilities,True,USD
8,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108000.0,"AWS,Azure,Computer Science,Consulting,Dataflow...",no-Facilities,False,USD
15,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,"Business Intelligence,Excel,Genetics,,,",no-Facilities,False,NaN
...,...,...,...,...,...,...,...,...,...,...
11117,C3.ai,Lead Data Scientist - Healthcare,"London, UK",Full Time,Senior-level,129000.0,"Architecture,Classification,Computer Science,D...",no-Facilities,True,USD
11123,C3.ai,Data Scientist / Senior Data Scientist (Federal),"Tysons, VA; Dayton, OH; Redwood City, CA",Full Time,Senior-level,123000.0,"Architecture,Classification,Computer Science,C...",no-Facilities,False,USD
11133,C3.ai,Data Science Instructor,"Redwood City, California",Full Time,Senior-level,109000.0,"Architecture,Clustering,ETL,Jupyter,Machine Le...",no-Facilities,False,USD
11157,Publicis Groupe,"Associate Director, Data Science","New York City, United States",Full Time,Mid-level,106000.0,"Bayesian,Classification,Clustering,Data analys...",no-Facilities,False,USD
11168,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,"Computer Science,Data Analytics,Data Mining,Ec...",no-Facilities,True,USD

In [160]:
dataFrame=split_comma_column_values ("Requirment of the company ",dataFrame)

In [161]:
dataFrame

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Computer Science,no-Facilities,True,USD
1,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Data quality,no-Facilities,True,USD
2,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Genetics,no-Facilities,True,USD
3,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Mathematics,no-Facilities,True,USD
4,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,SAS,no-Facilities,True,USD
...,...,...,...,...,...,...,...,...,...,...
60325,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Data Analytics,no-Facilities,True,USD
60326,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Data Mining,no-Facilities,True,USD
60327,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Economics,no-Facilities,True,USD
60328,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,Engineering,no-Facilities,True,USD
60329,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39000.0,GCP,no-Facilities,True,USD

In [174]:
print("list of unique Requirment of the company :",dataFrame["Requirment of the company "].unique().tolist()),"Length :"+str(len(dataFrame["Requirment of the company "].unique().tolist()))

list of unique Requirment of the company : ['Computer Science', 'Data quality', 'Genetics', 'Mathematics', 'SAS', 'Statistics', 'Agile', 'Data management', 'Finance', 'Security', 'Architecture', 'AWS', 'Computer Vision', 'Deep Learning', 'Engineering', 'Industrial', 'Oracle', 'Power BI', 'R', 'R&D', 'Azure', 'Consulting', 'Dataflow', 'Data pipelines', 'Machine Learning', 'NLP', 'NumPy', 'Banking', 'Excel', '', 'Business Intelligence', 'Big Data', 'Matlab', 'APIs', 'Data analysis', 'Keras', 'PhD', 'Business Analytics', 'Economics', 'Data Analytics', 'Market research', 'Privacy', 'Spark', 'BigQuery', 'LLMs', 'Pandas', 'Python', 'CUDA', 'Docker', 'Git', 'GitHub', 'GitLab', 'Redshift', 'Data warehouse', 'Looker', 'Data visualization', 'Metabase', 'E-commerce', 'Airflow', 'Clustering', 'Data governance', 'Data Mining', 'Blockchain', 'Databricks', 'SQL', 'CI/CD', 'DevOps', 'ETL', 'Crypto', 'Fraud risk', 'Tableau', 'Cybernetics', 'DataRobot', 'A/B testing', 'Angular', 'JavaScript', 'Data Warehousing', 'KPIs', 'ML models', 'Pipelines', 'Classification', 'Bigtable', 'Distributed Systems', 'GCP', 'Generative modeling', 'DataOps', 'Research', 'Testing', 'Hadoop', 'Dagster', 'Physics', 'Causal inference', 'CX', 'Autonomous Driving', 'Linux', 'Matplotlib', 'MongoDB', 'Jira', 'React', 'Consulting firm', 'MySQL', 'GANs', 'Athena', 'Cassandra', 'ELT', 'Snowflake', 'Econometrics', 'Biology', 'BERT', 'Chatbots', 'Dataproc', 'NoSQL', 'ASR', 'FinTech', 'Prototyping', 'Ansible', 'Elasticsearch', 'Credit risk', 'Google Cloud', 'Feature engineering', 'EDA', 'Data strategy', 'JSON', 'Model design', 'Airtable', 'PostgreSQL', 'DynamoDB', 'Bayesian', 'EC2', 'Kubernetes', 'OOP', 'Grafana', 'Diffusion models', 'Drug discovery', 'Kafka', 'AI strategy', 'GPT', 'Drones', 'Bitbucket', 'MLFlow', 'Conversational AI', 'ICLR', 'ICML', 'FiveTran', 'AI governance', 'Robotics', 'Scrum', 'Scala', 'Model training', 'SLAM', 'Streaming', 'Chemistry', 'CAD', 'HuggingFace', 'Cluster analysis', 'Qlik', 'Data Studio', 'Nonprofit', 'Avro', 'MS SQL', 'Healthcare technology', 'API Development', 'UX', 'Ruby', 'CMake', 'Open Source', 'Golang', 'Linear algebra', 'Machine intelligence', 'Caffe', 'VR', 'Jupyter', 'Lambda', 'Predictive modeling', 'Amplitude', 'MXNet', 'ChatGPT', 'Kinesis', 'TypeScript', 'DICOM', 'LangChain', 'Unstructured data', 'PHP', 'GPT-3', 'GPT-4', 'Azkaban', 'GPU', 'RDBMS', 'Flink', 'Haystack', 'Driver\x92s license', 'Flask', 'Kanban', 'Parquet', 'OpenCV', 'STEM', 'MLOps', 'Plotly', 'D3', 'Circuit Design', 'EMNLP', 'ML infrastructure', 'Kubeflow', '3D Reconstruction', 'CSV', 'Elixir', 'OLAP', 'Julia', 'HPC', 'DB2', 'ECS', 'Content creation', 'Perl', 'Teaching', 'TensorFlow', 'ITIL', 'PyTorch', 'Lua', 'OpenAI', 'OCR', 'Pentaho', 'XML', 'XSD', 'AGI', 'DALL-E', 'Model inference', 'GloVe', 'Node.js', 'Informatica', 'OKR', 'Lidar', 'Periscope', 'SharePoint', 'HBase', 'PySpark', 'SSIS', 'NLTK', 'AIStats', 'Autoregressive models', 'Microservices', 'Minitab', 'SDLC', 'LookML', 'Core ML', 'Django', 'cuDNN', 'Anaconda', 'AI art', 'JAX', 'QlikView', '3D graphics', 'SDL', 'Vue', 'Biochemistry', 'AI content', 'REST API', 'KNIME', 'Alpaca', 'NLG', 'ANN', 'NeurIPS', 'Fortran', 'Transformers', 'Clinical NLP', 'Teradata', 'Kibana', 'HDFS', 'Arrow', 'C++', '.NET', 'Travel', 'fastai', 'Horovod', 'ISO 27001', 'Copywriting', 'HiveQL', 'Splunk', 'LightGBM', 'Clojure', 'SIMD', 'ELK', 'Model deployment', 'CoreML', 'TDD', 'Recommender systems', 'Maven']

(None, 'Length :286')

In [175]:
dataFrame[dataFrame["Job Title"]=='AML/CFT & Data Analyst']

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
6,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Agile,no-Facilities,True,USD
7,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Data management,no-Facilities,True,USD
8,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Finance,no-Facilities,True,USD
9,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Security,no-Facilities,True,USD
44472,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,42000.0,Agile,no-Facilities,True,USD
44473,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,42000.0,Data management,no-Facilities,True,USD
44474,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,42000.0,Finance,no-Facilities,True,USD
44475,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,42000.0,Security,no-Facilities,True,USD

In [164]:
df_index = dataFrame[(dataFrame["Requirment of the company "] == '') & (dataFrame['Facilities'] == 'no-Facilities')].index
dataFrame.drop(df_index , inplace=True)
dataFrame.head(15)

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Computer Science,no-Facilities,True,USD
1,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Data quality,no-Facilities,True,USD
2,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Genetics,no-Facilities,True,USD
3,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Mathematics,no-Facilities,True,USD
4,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,SAS,no-Facilities,True,USD
5,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48000.0,Statistics,no-Facilities,True,USD
6,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Agile,no-Facilities,True,USD
7,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Data management,no-Facilities,True,USD
8,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Finance,no-Facilities,True,USD
9,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48000.0,Security,no-Facilities,True,USD
12,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,not-specified,90000.0,Agile,Career development,True,USD
13,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,not-specified,90000.0,Architecture,Career development,True,USD
14,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,not-specified,90000.0,AWS,Career development,True,USD
15,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,not-specified,90000.0,Computer Science,Career development,True,USD
16,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,not-specified,90000.0,Computer Vision,Career development,True,USD

In [165]:
dataFrame[(dataFrame["Requirment of the company "] == '') & (dataFrame['Facilities'] == 'no-Facilities')]

Empty DataFrame
Columns: [Company, Job Title, Location, Job Type, Experience level, Salary, Requirment of the company , Facilities, Plus, Currency]
Index: []

In [166]:
dataFrame['Currency'][dataFrame["Salary"] == 0]=dataFrame['Currency'].fillna('--')

C:\Users\Youcode\AppData\Local\Temp\ipykernel_81164\658576616.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataFrame['Currency'][dataFrame["Salary"] == 0]=dataFrame['Currency'].fillna('--')

In [180]:
dataFrame[dataFrame["Salary"] == 0]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities,Plus,Currency
90,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Business Intelligence,no-Facilities,False,--
91,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Excel,no-Facilities,False,--
92,NielsenIQ,Intern (Business Intelligence Service Support),"Bangkok, Thailand",Internship,Entry-level,0.0,Genetics,no-Facilities,False,--
96,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,0.0,Big Data,Career development,False,--
97,Western Digital,Summer 2023 Data Engineering Intern,"San Jose, CA, United States",Internship,Entry-level,0.0,Computer Science,Career development,False,--
...,...,...,...,...,...,...,...,...,...,...
59827,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Computer Science,Salary bonus,False,--
59828,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Data analysis,Salary bonus,False,--
59829,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Data visualization,Salary bonus,False,--
59830,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Machine Learning,Salary bonus,False,--
59831,DNSFilter,Senior Data Scientist,"Washington, District of Columbia, United State...",Full Time,Mid-level,0.0,Mathematics,Salary bonus,False,--